  <img src='Data/ERD.png'>

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus as urlquote
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "433541Be" # (or whatever password you chose during mysql installation)
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
engine = create_engine(connection)

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [5]:
#create_database(connection)

In [6]:
database_exists(connection)

True

In [21]:
user_df = pd.read_csv('data/users.csv')
user_df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [22]:
user_df.to_sql('user', engine, if_exists = 'replace')

3

In [23]:
q = """SELECT * FROM user;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
favorites_df = pd.read_csv('data/favorites.csv')
favorites_df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [13]:
favorites_df.to_sql('favorites', engine, if_exists = 'replace')

7

In [14]:
q = """SELECT * FROM favorites;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5
6      6        3        6

In [15]:
books_df = pd.read_csv('data/books.csv')
books_df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [16]:
books_df.to_sql('books', engine, if_exists = 'replace')

6

In [17]:
author_df = pd.read_csv('data/author.csv')
author_df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [19]:
author_df.to_sql('author', engine, if_exists = 'replace')

5

In [24]:
q = """SHOW TABLES"""
pd.read_sql(q, engine)

  Tables_in_books
0          author
1           books
2       favorites
3            user

In [25]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT user.id FROM user WHERE (user.last_name = "Doe" AND user.first_name = "John"))"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1